// สรา้ง Array เก็บข้อมูลของนักเรียนก่อน โดยจะเก็บเป็๋น Array เพราะมีหลายคน 
// จากนั้นจะสร้าง Object ใน Array เเพื่อบอกข้อมูลเฉพาะของ Object นั้นๆ
// เช่น Object ตัวเเรกเป็นของ สมศักดิ์ เธียรนิติฐาดล เเละ คะเเนนของเขาจะอยู่ใน Array score 

var studentscore = [
    {
        studentName: "สมศักดิ์ เธียรนิติฐาดล",
        score: [7, 8, 1, 7, 0, 4, 20, 25]
    },
    {
        studentName: "สายยัน กิตติธนปกรณ",
        score: [9, 1, 5, 8, 7, 1, 2, 2]
    },
    {
        studentName: "สมชาย พัฒนภิญญาดล",
        score: [9, 6, 4, 1, 2, 3, 25, 12]
    },
    {
        studentName: "สิทธิชัย ปุญญออภิวัฒนา",
        score: [8, 7, 8, 0, 1, 5, 15, 12]
    },
    {
        studentName: "เอกชัย เอกธนนรากุล",
        score: [9, 8, 7, 1, 3, 6, 27, 27]
    },
    {
        studentName: "สมศรี เปรมธาราโชติ",
        score: [10, 10, 10, 10, 6, 9, 24, 25]
    },
    {
        studentName: "นักรบภักดี ศิรินรกุล",
        score: [7, 8, 9, 6, 10, 5, 25, 30]
    },
] 


// [ สมศักดิ์เธียรนิติฐาดล ] [ 7,8,1,7,0,4,20,25];
// [ สายยันกิตติธนปกรณ ] [ 9,1,5,8,7,1,2,2];
// [ สมชายพัฒนภิญญาดล ] [ 9,6,4,1,2,3,25,12];
// [ สิทธิชัยปุญญออภิวัฒนา ] [ 8,7,8,0,1,5,15,12];
// [ เอกชัยเอกธนนรากุล ] [ 9,8,7,1,3,6,27,27];
// [ สมศรีเปรมธาราโชติ ] [ 10,10,10,10,6,9,24,25];
// [ นักรบภักดีศิรินรกุล ] [ 7,8,9,6,10,5,25,30];
// คะแนนแต่ละใบงาน     1 2 3 4 5  6 กลาง ปลาย

// [ 72,35,62,56,88,104,100 ];



// จากนั้น จะทำการ Loop ตามจำนวนของ object ใน studentscore
// โดยในเเต่ละรอบจะดึง score ของ คนๆนั้นมาด้วย
// โดยถ้าตัวเเปรไหนเป็น Array ที่มีข้อมูล ที่เป็นตัวเลขอยู่ด้านใน เเละต้องการจะนำมาบอกวันให้หมด
// จะมีคำสั่ีงพิเสดที่ชื่อว่า Reduce โดยใน Function จะรับ a เเละ b ซึ่งคือ เเละ a + b ตามความยาวของ score

// จากนั้นจะทำการเพิ่มข้อมูลที่คำนวนเสร็จเเล้วไปที่ finalScore โดยสามารถใช้คำสั่ง push เพื่อเพิ่มไปใน Array ได้
// โดยหลังจากเพิ้มเสร็จเเล้วจะเป็นเเบบนี้ [ 72,35,62,56,88,104,100 ] อยู่ในตัวเเปร finalScore


let finalScore = [];
for(let i = 0; i < studentscore.length; i++){
    const sum = studentscore[i].score.reduce((a, b) => a + b);
    finalScore.push(sum);
}


 
// จากนั้นจะ loop ตามความยาวของ finalScore
// จากนั้น จะสร้างตัวเเปรเพื่อเก็บ คะเเนน โดยดึงมาจาก finalScore[ตำเเหน่งของข้อมูล]
// จากนั้น จะเช็คคะเเนนไปเรื่อยๆ เมื่อพบเเล้วจะเเสดงผล

for (var i = 0; i < finalScore.length; i++){
    var score = finalScore[i];

    if (score >= 80 ){
        console.log('นักเรียนคนที่ '+ (i+1) +  ' จะได้เกรด A');
    }
    else if (score >= 75 ){
        console.log('นักเรียนคนที่ '+ (i+1) + ' จะได้เกรด B+');
    }
    else if (score >= 70 ){
        console.log('นักเรียนคนที่ '+ (i+1) + ' จะได้เกรด B');
    }
    else if (score >= 65 ){
        console.log('นักเรียนคนที่ '+ (i+1) + ' จะได้เกรด C+');
    }
    else if (score >= 60 ){
        console.log('นักเรียนคนที่ '+ (i+1) + ' จะได้เกรด C');
    }
    else if (score >= 55 ){
        console.log('นักเรียนคนที่ '+ (i+1) + ' จะได้เกรด D+');
    }
    else if (score >= 50 ){
        console.log('นักเรียนคนที่ '+ (i+1) + ' จะได้เกรด D');
    }
    else if (score <= 49 ){
        console.log( 'นักเรียนคนที่ ' + (i+1) + ' จะได้เกรด F');       
    }
}